load_tests/server/artillery_postal_code.yml
config:
  target: "http://localhost:3010/api/sidebar/postalCode"
  phases:
    - duration: 20
      arrivalRate: 20
  payload:
    path: "postal_codes_50000.csv"
    fields:
      - "id"
scenarios:
  - name: "Postal Code"
    flow:
      - loop:
        - get:
            url: "/{{ id }}"
        count: 100